// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить,
// до якої четверті години попадає число (в першу, другу, третю или четверту частину години).

// let time = +prompt('Введіть число від 0 до 59');
// if (time >= 0 && time <= 14) {
//     console.log('Перша чверть');
// } else if (time >= 15 && time <= 29) {
//     console.log('Друга чверть');
// } else if (time >= 30 && time <= 44) {
//     console.log('Третя чверть');
// } else if (time >= 45 && time <= 59) {
//     console.log('Четверта чверть');
// } else {
//     alert('Читай завдання!!!');
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду)
// місяця потрапляє це число (у першу, другу чи третю).

// let day = +prompt('Введить любе число місяця');
// if (day >= 1 && day <=10) {
//     console.log('Перша декада');
// } else if (day >= 11 && day <=20) {
//     console.log('Друга декада');
// } else if (day >= 21 && day <=31) {
//     console.log('Третя декада');
// } else {
//     alert('Читай завдання!!!');
// }

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test = true;
if (test) {
    console.log('Вірно');
} else {
    console.log('Невірно');
}

let testTest = (test) ? 'Вірно' : 'Невірно';
console.log(testTest);

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3

let a = -3;
if (a === 0) {
    console.log('Невірно');
} else {
    console.log('Вірно');
}

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і
// на екрані відображається інфа що заплановано на цей день.

// let i = +prompt('Введіть порядковий номер дня тижня');
// switch (i) {
//     case '1':
//         console.log('Понеділок - вивчити 1 урок');
//         break;
//     case '2':
//         console.log('Вівторок - вивчити 2 урок');
//         break;
//     case '3':
//         console.log('Середа - вивчити 3 урок');
//         break;
//     case '4':
//         console.log('Четвер - вивчити 4 урок');
//         break;
//     case '5':
//         console.log('П`ятниця - вивчити 5 урок');
//         break;
//     case '6':
//         console.log('Субота - вивчити 6 урок');
//         break;
//     case '7':
//         console.log('Неділя - вивчити 7 урок');
//         break;
//     default:
//         alert('!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!')
// }

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = +prompt('Введіть рік');
// if (year % 4 === 0) {
//     console.log('Рік високосний!!!!!');
// } else {
//     console.log('Рік нормальній!');
// }

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let text = prompt('Яка «офіційна» назва JavaScript?');
// if (text === 'ECMAScript') {
//     alert('Правильно!');
// } else {
//     alert('Не знаєте? ECMAScript!');
// }