// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = prompt('Введіть число від 0 до 59');
// if (time >= 0 && time <= 14) {
//     console.log('Перша чверть');
// } else if (time >= 15 && time <= 29) {
//     console.log('Друга чверть');
// } else if (time >= 30 && time <= 44) {
//     console.log('Третя чверть');
// } else if (time >= 45 && time <= 59) {
//     console.log('Четверта чверть');
// } else {
//     alert('Читай завдання!!!');
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = prompt('Введить любе число місяця');
// if (day >= 1 && day <=10) {
//     console.log('Перша декада');
// } else if (day >= 11 && day <=20) {
//     console.log('Друга декада');
// } else if (day >= 21 && day <=31) {
//     console.log('Третя декада');
// } else {
//     alert('Читай завдання!!!');
// }

// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test = false;
// if (!test) {
//     console.log('Вірно');
// } else {
//     console.log('Невірно');
// }

let testTest = (!test) ? 'Вірно' : 'Невірно';
console.log(testTest);

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let a = -3;
if (a === 0) {
    console.log('Невірно');
} else {
    console.log('Вірно');
}