//- Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// Потрібно зробити перевірку якщо кількість елементів у масиві більше або дорівнює 3,
// то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
console.log(friends);
if (friends.length >= 3) {
    console.log('великий масив, в якому  3 і більше елементи');
} else {
    console.log('маленький масив, в якому менше 3-х елементів');
}

//- Маємо 3 числа і між ним  нам потрібно знайти те що посередині. Знайти, яке з них є середнім
// (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let a = 6;
let b = 34;
let c = 56;
if ((a > b && a < c) || (a > c && a < b)) {
    console.log('Середне число', a);
} else if (b > a && b < c) {
    console.log('Середне число', b);
} else if (b > c && b < a) {
    console.log('Середне число', b);
} else if (c > a && c < b) {
    console.log('Середне число', c);
} else if (c > b && c < a) {
    console.log('Середне число', c);
} else if (a === b) {
    console.log(a, 'равно', b);
} else if (a === c) {
    console.log(a, 'равно', c);
} else {
    console.log(b, 'равно', c)
}

//- Перепишіть конструкцію if з використанням умовного оператора '?':
//let result;
//if (a + b < 4) {
//    result = 'Мало';
//} else {
//    result = 'Багато';
//}


//- Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
//напишіть це тернарним оператором