//- Користувач вводить або має два числа.
//    Потрібно знайти та вивести максимальне число з тих двох .
//    Також потрібно врахувати коли введені рівні числа.

//let a = +prompt('Введіть число A');
//let b = +prompt('Введіть число B');
//if (a > b) {
//    console.log(a);
//} else if (b > a) {
//    console.log(b);
//} else {
//    console.log('Числа равні');
//}


//- У першому під'їзді квартири з 1 до 20. У другому з 21 по 48.
// У третьому з 49 по 90.
//Користувач вводить номер квартири просто в змінні або через prompt('') .
//    Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

//let kv = +prompt('Введіть номер квартири');
//if (kv >= 1 && kv <= 20) {
//    console.log('Підїзд 1');
//} else if (kv >= 21 && kv <= 48) {
//    console.log('Підїзд 2');
//} else if (kv >= 49 && kv <=90) {
//    console.log('Підїзд 3');
//} else {
//    console.log('error')
//}

//- Ми маємо змінну number в яку користувач задає числове значення, якщо
// змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

//let number = +prompt('Число');
//if (number === 10) {
//    console.log('ВІРНО');
//} else {
//    console.log('НЕВІРНО');
//}

//- Ми маємо змінну x в яку користувач задає  значення,
// якщо в змінну записане число, вивести 1, якщо в змінну записали стрінгу
// вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 4.
//якщо в змінну записали щось інше, спрацьовує else

//let x = 123;
//if (typeof x === 'number') {
//    console.log('1');
//} else if (typeof x === 'string') {
//    console.log('2');
//} else if (typeof x === 'boolean') {
//    console.log('3');
//} else if (typeof x === 'object') {
//    console.log('4');
//} else {
//    console.log('qwer');
//}

//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//    Змінна, яка характеризує температуру. Якщо температура від +10 до +22
//    вивести повідомлення що ми йдемо ВЧИТИСЯ .
//    Якщо інша темпаретура, тоді виводимо повідомлення що сидимо
//    вдома і вчимося ОНЛАЙН

//let tmp = -18;
//if (tmp >= 10 && tmp <= 22) {
//    alert('ми йдемо ВЧИТИСЯ');
//} else {
//    alert('вчимося ОНЛАЙН');
//}

//- За допомогою switch case - реалізувати гру - вікторину,
// де ми вводимо число від 1 до 5. І взалежності від введеного числа
// нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число
// не підходить тоді  вивести Повідомлення - що число не вірне ... .

//let number = +prompt('1-5');
//switch (number) {
//    case 1:
//        console.log('avto');
//        break;
//    case 2:
//        console.log('moto');
//        break;
//    case 3:
//        console.log('phone');
//        break;
//    case 4:
//        console.log('PC');
//        break;
//    case 5:
//        console.log('100 $');
//        break;
//    default:
//        console.log('число не вірне');
//}