// - Дано натуральное число n. Выведите все числа от 1 до n.

// let foo = (n) => {
//     if (typeof n === 'number') {
//         for (let i = 1; i <= n; i++) {
//             document.write(`${i} `);
//         }
//     } else {
//         alert('Введіть число');
//     }
// };
//
// foo(1234);

// - Даны два целых числа A и В . Выведите все числа от A до B включительно,
//   в порядке возрастания, если A < B, или в порядке убывания в противном случае.

// let foo = (a, b) => {
//     if (typeof a === 'number' && typeof b === 'number') {
//         if (a < b) {
//             for (let i = a; i <= b; i++) {
//                 document.write(`${i} `);
//             }
//         } else if (a > b) {
//             for (let i = a; i >= b; i--) {
//                 document.write(`${i} `);
//             }
//         } else {
//             document.write(`Числа равні ${a}=${b}!`)
//         }
//     } else {
//         alert('Введіть число');
//     }
// };
//
//
// foo(10, 5);

// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]
