// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)

// function foo(a, b, c) {
//     if (a < b && a < c) {
//         console.log(a);
//     } else if (b < a && b < c) {
//         console.log(b);
//     } else {
//         console.log(c);
//     }
// }
//
// foo(55, 33, 88);

// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)

// function foo(a, b, c) {
//     if (a > b && a > c) {
//         console.log(a);
//     } else if (b > a && b > c) {
//         console.log(b);
//     } else {
//         console.log(c);
//     }
// }
//
// foo(24, 67, 44);

// - створити функцію яка повертає найбільше число з масиву

// let arr = [1222, 3245, 123, 3456, 76, 1324, 234, 4567, 23];
//
// function foo(array) {
//     let max = array[0];
//     for (let arrayElement of array) {
//         if (arrayElement > max) {
//             max = arrayElement;
//         }
//     }
//     return max;
// }
//
// console.log(foo(arr));

// - створити функцію яка повертає найменьше число з масиву

// let arr = [1222, 3245, -123, 3456, 76, 1324, 234, 4567, 23];
//
// function foo(array) {
//     let min = array[0];
//     for (let arrayElement of array) {
//         if (arrayElement < min) {
//             min = arrayElement;
//         }
//     }
//     return min;
// }
//
// console.log(foo(arr));

// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
